package com.xiaopeng.test

import com.xiaopeng.bi.utils.{ConfigurationUtil, FileUtil, SparkUtils}
import org.apache.spark.sql.hive.HiveContext
import org.apache.spark.{SparkConf, SparkContext}

/**
  * ltv: 用户价值分析，注册和支付
  */
object GamePublish {

  def main(args: Array[String]): Unit = {
    // 创建各种上下文
    val sparkConf = new SparkConf().setAppName(this.getClass.getName.replace("$", ""))
      .set("spark.sql.shuffle.partitions", ConfigurationUtil.getProperty("spark.sql.shuffle.partitions"))
    SparkUtils.setMaster(sparkConf);
    val sc = new SparkContext(sparkConf)
    val hiveContext = new HiveContext(sc)
    hiveContext.sql("use yyft")


    val resultSql ="select distinct ods_order.imei from \n(select distinct game_id,imei  from  ods_order)ods_order\njoin  (select distinct game_id from ods_publish_game) ods_publish_game on ods_order.game_id=ods_publish_game.game_id\njoin  (select distinct reg_os_type,imei from ods_regi_rz where reg_os_type='ANDROID')ods_regi_rz on ods_order.imei=ods_regi_rz.imei"
    val resultDf = hiveContext.sql(resultSql)

    resultDf.foreachPartition(rows => {
      for (insertedRow <- rows) {
        FileUtil.apppendTofile("/home/hduser/projs/logs/publish_game_android.txt", insertedRow.get(0).toString)
      }
    })

    val resultSql2 ="select distinct ods_order.imei from \n(select distinct game_id,imei  from  yyft.ods_order where game_id not in(661,\n1296,\n1765,\n2216,\n2220,\n2221,\n2222,\n2223,\n2287,\n2344,\n2347,\n2349,\n2359,\n2365,\n2366,\n2368,\n2388,\n2411,\n2418,\n2421,\n2428,\n2429,\n2430,\n2492,\n2493,\n2499,\n2504,\n2509,\n2545,\n2559,\n2560,\n2561,\n2563,\n2564,\n2565,\n2581,\n2629,\n2635,\n2636,\n2646,\n2651,\n2656,\n2659,\n2664,\n2665,\n2668,\n2672,\n2704,\n2705,\n2707,\n2708,\n2711,\n2724,\n2725,\n2727,\n2732,\n2781,\n2782,\n2783,\n2784,\n2785,\n2786,\n2787,\n2800,\n2810,\n2814,\n2816,\n2817,\n2819,\n2823,\n2825,\n2832,\n2835,\n2836,\n2839,\n2840,\n2850,\n2865,\n2870,\n2871,\n2876,\n2877,\n2878,\n2879,\n2880,\n2881,\n2882,\n2890,\n2891,\n2892,\n2894,\n2895,\n2898,\n2915,\n2916,\n2917,\n2921,\n2922,\n2923,\n2927,\n2931,\n2935,\n2939,\n2940,\n2948,\n2949,\n2952,\n2954,\n2970,\n2971,\n2974,\n2981,\n2985,\n2986,\n2987,\n2995,\n3000,\n3003,\n3010,\n3016,\n3017,\n3018,\n3019,\n3020,\n3021,\n3022,\n3028,\n3035,\n3036,\n3050,\n3051,\n3052,\n3053,\n3054,\n3061,\n3063,\n3065,\n3084,\n3085,\n3087,\n3091,\n3092,\n3093,\n3094,\n3095,\n3096,\n3097,\n3099,\n3100,\n3102,\n3103,\n3127,\n3128,\n3130,\n3139,\n3140,\n3141,\n3145,\n3146,\n3149,\n3150,\n3151,\n3152,\n3156,\n3160,\n3161,\n3162,\n3170,\n3180,\n3181,\n3182,\n3183,\n3184,\n3190,\n3193,\n3194,\n3202,\n3204,\n3205,\n3206,\n3207,\n3208,\n3209,\n3212,\n3213,\n3214,\n3215,\n3216,\n3217,\n3218,\n3219,\n3222,\n3223,\n3224,\n3225,\n3228,\n3231,\n3232,\n3233,\n3234,\n3235,\n3236,\n3237,\n3238,\n3239,\n3240,\n3242,\n3245,\n3250,\n3251,\n3252,\n3253,\n3255,\n3258,\n3273,\n3274,\n3275,\n3276,\n3277,\n3282,\n3283,\n3290,\n3294,\n3295,\n3299,\n3300,\n3306,\n3309,\n3310,\n3311,\n3312,\n3315,\n3316,\n3318,\n3319,\n3322,\n3323,\n3324,\n3325,\n3326,\n3327,\n3328,\n3330,\n3333,\n3334,\n3336,\n3339,\n3344,\n3346,\n3347,\n3348,\n3349,\n3350,\n3351,\n3358,\n3362,\n3363,\n3365,\n3366,\n3372,\n3378,\n3380,\n3381,\n3382,\n3386,\n3396,\n3398,\n3399,\n3401,\n3402,\n3403,\n3404,\n3405,\n3413,\n3415,\n3427,\n3428,\n3429,\n3430,\n3432,\n3434,\n3435,\n3436,\n3438,\n3441,\n3442,\n3443,\n3444,\n3453,\n3456,\n3462,\n3468,\n3469,\n3470,\n3476,\n3486,\n3487,\n3488,\n3493,\n3494,\n3499,\n3500,\n3505,\n3510,\n3512,\n3514,\n3517,\n3519,\n3520,\n3521,\n3523,\n3524,\n3526,\n3527,\n3531,\n3540,\n3543,\n3544,\n3550,\n3555,\n3559,\n3561,\n3563,\n3565,\n3566,\n3567,\n3568,\n3569,\n3570,\n3571,\n3572,\n3585,\n3586,\n3596,\n3597,\n3598,\n3599,\n3600,\n3601,\n3604,\n3605,\n3606,\n3607,\n3608,\n3611,\n3614,\n3617,\n3618,\n3619,\n3622,\n3623,\n3624,\n3625,\n3631,\n3637,\n3640,\n3641,\n3642,\n3646,\n3649,\n3650,\n3654,\n3660,\n3664,\n3671,\n3672,\n3680,\n3682,\n3683,\n3689,\n3690,\n3696,\n3698,\n3699,\n3702,\n3703,\n3704,\n3705,\n3724,\n3726,\n3727,\n3741,\n3744,\n3745,\n3746,\n3747,\n3748,\n3749,\n3750,\n3751,\n3756,\n3760,\n3762,\n3765,\n3766,\n3767,\n3768,\n3769,\n3776,\n3777,\n3778,\n3779,\n3783,\n3785,\n3786,\n3787,\n3788,\n3789,\n3790,\n3791,\n3792,\n3796,\n3798,\n3799,\n3800,\n3801,\n3807,\n3809,\n3810,\n3819,\n3820,\n3823,\n3826,\n3828,\n3829,\n3831,\n3832,\n3833,\n3834,\n3835,\n3838,\n3840,\n3841,\n3843,\n3844,\n3845,\n3846,\n3847,\n3848,\n3849,\n3850,\n3851,\n3852,\n3853,\n3861,\n3864,\n3865,\n3867,\n3868,\n3871,\n3872,\n3875,\n3877,\n3878,\n3879,\n3880,\n3881,\n3882,\n3884,\n3885,\n3889,\n3890,\n3891,\n3892,\n3893,\n3895,\n3896,\n3898,\n3906,\n3913,\n3917,\n3920,\n3921,\n3924,\n3926,\n3934,\n3936,\n3937,\n3940,\n3941,\n3942,\n3948,\n3949,\n3957,\n3969,\n3973,\n3975,\n3977,\n3978,\n3980,\n3981,\n3982,\n3995,\n3996,\n3998,\n4003,\n4004,\n4007,\n4008,\n4009,\n4010,\n4011,\n4012,\n4013,\n4014,\n4017,\n4018,\n4028,\n4029,\n4030,\n4032,\n4034,\n4035,\n4036,\n4041,\n4044,\n4045,\n4050,\n4058,\n4059,\n4060,\n4064,\n4067,\n4076,\n4078,\n4079,\n4082,\n4085,\n4090,\n4091,\n4092,\n4093,\n4094,\n4095,\n4096,\n4099,\n4105,\n4106,\n4109,\n4112,\n4114,\n4115,\n4116,\n4118,\n4119,\n4120,\n4121,\n4123,\n4128,\n4129,\n4131,\n4132,\n4138,\n4146,\n4148,\n4151,\n4156,\n4158,\n4162,\n4163,\n4164,\n4165,\n4166,\n4167,\n4173,\n4174,\n4175,\n4176,\n4177,\n4180,\n4183,\n4187,\n4189,\n4190,\n4192,\n4193,\n4195,\n4199,\n4203,\n4204,\n4206,\n4207,\n4208,\n4211,\n4212,\n4214,\n4215,\n4216,\n4217,\n4218,\n4226,\n4235,\n4238,\n4240,\n4241,\n4242,\n4244,\n4245,\n4246,\n4248,\n4249,\n4255,\n4256,\n4267,\n4268,\n4269,\n4272,\n4275,\n4276,\n4277,\n4283,\n4284,\n4285,\n4289,\n4290,\n4292,\n4296,\n4297,\n4298,\n4301,\n4302,\n4303,\n4305,\n4306,\n4307,\n4309,\n4312,\n4313,\n4314,\n4315,\n4316,\n4317,\n4318,\n4322,\n4325,\n4326,\n4327,\n4335,\n4339,\n4340,\n4349,\n4359,\n4361,\n4362,\n4363,\n4364,\n4374,\n4377,\n4378,\n4379,\n4380,\n4382,\n4384,\n4387,\n4388,\n4389,\n4390,\n4391,\n4392,\n4398,\n4402,\n4404,\n4405,\n4407,\n4410,\n4419,\n4425,\n4428,\n4430,\n4431,\n4443,\n4445,\n4446,\n4452,\n4455,\n4458,\n4459,\n4460,\n4461,\n4462,\n4463,\n4464,\n4465,\n4466,\n4467,\n4468,\n4473,\n4474,\n4480,\n4484,\n4485,\n4486,\n4487,\n4488,\n4489,\n4492,\n4493,\n4494,\n4495,\n4498,\n4503,\n4506,\n4514,\n4515,\n4517,\n4518,\n4519,\n4520,\n4527,\n4529,\n4530,\n4532,\n4535,\n4536,\n4544,\n4548,\n4549,\n4551,\n4554,\n4555,\n4557,\n4558,\n4561,\n4562,\n4563,\n4565,\n4566,\n4567,\n4568,\n4569,\n4581,\n4589,\n4590,\n4591,\n4592,\n4593,\n4596,\n4606,\n4607,\n4608,\n4610,\n4611,\n4612,\n4613,\n4614,\n4615,\n4618,\n4619,\n4627))ods_order\njoin  (select distinct reg_os_type,imei from yyft.ods_regi_rz where reg_os_type='ANDROID')ods_regi_rz on ods_order.imei=ods_regi_rz.imei"
    val resultDf2 = hiveContext.sql(resultSql2)

    resultDf2.foreachPartition(rows => {
      for (insertedRow <- rows) {
        FileUtil.apppendTofile("/home/hduser/projs/logs/no_publish_game_android.txt", insertedRow.get(0).toString)
      }
    })
    sc.stop()
  }
}
